# Hands-on lab: JOIN Operations

Connect to the database

In [1]:
%load_ext sql
%sql ibm_db_sa://qpf19891:v65bfcz5bf8b^q8h@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB

'Connected: qpf19891@BLUDB'

View the table for __employees__

In [2]:
%sql select * from employees

 * ibm_db_sa://qpf19891:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '123459   ', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400      ', Decimal('60000.00'), '30004    ', '5        '),
 ('E1005    ', 'Ahmed', 'Hussain', '123410   ', datetime.date(1981, 1, 4), 'M', '216 Oak Tree, Geneva,IL', '500      ', Decimal('70000.00'), '30001    ', '2        '),
 ('E1006    ', 'Nancy', 'Allen', '123411   ', datetime.date(1978, 2, 6), 'F', '111 Green Pl, Elgin,IL', '600      ', Decimal('90000.00'), '30001    ', '2        '),
 ('E1007    ', 'Mary', 'Thomas', '123412   ', datetime.date(1975, 5, 5), 'F', '100 Rose Pl, Gary,IL', '650      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1008    ', 'Bharath', 'Gupta', '123413   ', datetime.date(1985, 5, 6), 'M', '145 Berry Ln, Naperville,IL', '660      ', Decimal('65000.00'), '30003    ', '7        '),
 ('E1009    ', 'Andrea', 'Jones', '123414   ', datetime.date(1990, 7, 9), 'F', '120 Fall Creek, Gary,IL', '234      ', Decimal('70000.00'), '30003    ', '7        '),
 ('E1010    ', 'Ann', 'Jacob', '123415   ', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220      ', Decimal('70000.00'), '30004    ', '5        ')]

and for the table __departments__

In [3]:
%sql select * from departments

 * ibm_db_sa://qpf19891:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('2        ', 'Architect Group', '30001    ', 'L0001    '),
 ('5        ', 'Software Group', '30002    ', 'L0002    '),
 ('7        ', 'Design Team', '30003    ', 'L0003    ')]

### Select the names and job start dates of all employees who work for the department number 5

In [4]:
%sql select e.f_name, e.l_name, j.start_date from employees e inner join job_history j on e.emp_id = j.empl_id where e.dep_id = 5;

 * ibm_db_sa://qpf19891:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('Alice', 'James', datetime.date(2001, 8, 1)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

### Select the names, job start dates, and job titles of all employees who work for the dept number 5

In [5]:
%sql select e.f_name, e.l_name, jh.start_date, j.job_title from employees e inner join job_history jh on e.emp_id = jh.empl_id innerjoin jobs j on e.job_id = j.job_ident where e.dep_id = 5;

 * ibm_db_sa://qpf19891:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
(ibm_db_dbi.ProgrammingError) ibm_db_dbi::ProgrammingError: SQLNumResultCols failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0104N  An unexpected token "innerjoin" was found following ".emp_id = jh.empl_id".  Expected tokens may include:  "JOIN".  SQLSTATE=42601 SQLCODE=-104
[SQL: select e.f_name, e.l_name, jh.start_date, j.job_title from employees e inner join job_history jh on e.emp_id = jh.empl_id innerjoin jobs j on e.job_id = j.job_ident where e.dep_id = 5;]
(Background on this error at: http://sqlalche.me/e/f405)

### Select the employee id, last name, dept id and dept name for all employees

In [6]:
%sql select e.emp_id, e.l_name, e.dep_id, d.dep_name from employees e left join departments d on e.dep_id = d.dept_id_dep;

 * ibm_db_sa://qpf19891:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group'),
 ('E1006    ', 'Allen', '2        ', 'Architect Group'),
 ('E1005    ', 'Hussain', '2        ', 'Architect Group'),
 ('E1002    ', 'James', '5        ', 'Software Group'),
 ('E1010    ', 'Jacob', '5        ', 'Software Group'),
 ('E1004    ', 'Kumar', '5        ', 'Software Group'),
 ('E1003    ', 'Wells', '5        ', 'Software Group'),
 ('E1007    ', 'Thomas', '7        ', 'Design Team'),
 ('E1009    ', 'Jones', '7        ', 'Design Team'),
 ('E1008    ', 'Gupta', '7        ', 'Design Team')]

### Rewrite above query to limit result set to include only employees born before 1980

In [7]:
%sql select e.emp_id, e.l_name, e.dep_id, d.dep_name, e.b_date from employees e left join departments d on e.dep_id = d.dept_id_dep where year(e.b_date) < 1980;

 * ibm_db_sa://qpf19891:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group', datetime.date(1976, 1, 9)),
 ('E1006    ', 'Allen', '2        ', 'Architect Group', datetime.date(1978, 2, 6)),
 ('E1002    ', 'James', '5        ', 'Software Group', datetime.date(1972, 7, 31)),
 ('E1007    ', 'Thomas', '7        ', 'Design Team', datetime.date(1975, 5, 5))]

### Rewrite above query to include dept name only for those born before 1980

In [8]:
%sql select e.emp_id, e.l_name, e.dep_id, d.dep_name, e.b_date from employees e left join departments d on e.dep_id = d.dept_id_dep and year(e.b_date) < 1980;

 * ibm_db_sa://qpf19891:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group', datetime.date(1976, 1, 9)),
 ('E1002    ', 'James', '5        ', 'Software Group', datetime.date(1972, 7, 31)),
 ('E1003    ', 'Wells', '5        ', None, datetime.date(1980, 8, 10)),
 ('E1004    ', 'Kumar', '5        ', None, datetime.date(1985, 7, 20)),
 ('E1005    ', 'Hussain', '2        ', None, datetime.date(1981, 1, 4)),
 ('E1006    ', 'Allen', '2        ', 'Architect Group', datetime.date(1978, 2, 6)),
 ('E1007    ', 'Thomas', '7        ', 'Design Team', datetime.date(1975, 5, 5)),
 ('E1008    ', 'Gupta', '7        ', None, datetime.date(1985, 5, 6)),
 ('E1009    ', 'Jones', '7        ', None, datetime.date(1990, 7, 9)),
 ('E1010    ', 'Jacob', '5        ', None, datetime.date(1982, 3, 30))]

### Perform a Full Join on the employees and departments tables and select first name, last name and dept name of all employees

In [9]:
%sql select e.f_name, e.l_name, d.dep_name from employees e full join departments d on e.dep_id = d.dept_id_dep;

 * ibm_db_sa://qpf19891:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('John', 'Thomas', 'Architect Group'),
 ('Alice', 'James', 'Software Group'),
 ('Steve', 'Wells', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Ahmed', 'Hussain', 'Architect Group'),
 ('Nancy', 'Allen', 'Architect Group'),
 ('Mary', 'Thomas', 'Design Team'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Andrea', 'Jones', 'Design Team'),
 ('Ann', 'Jacob', 'Software Group')]

### Rewrite above query to include dept name to only male employees

In [10]:
%sql select e.f_name, e.l_name, e.sex, d.dep_name from employees e full join departments d on e.dep_id = d.dept_id_dep and e.sex = 'M';

 * ibm_db_sa://qpf19891:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('John', 'Thomas', 'M', 'Architect Group'),
 ('Steve', 'Wells', 'M', 'Software Group'),
 ('Santosh', 'Kumar', 'M', 'Software Group'),
 ('Ahmed', 'Hussain', 'M', 'Architect Group'),
 ('Bharath', 'Gupta', 'M', 'Design Team'),
 ('Alice', 'James', 'F', None),
 ('Nancy', 'Allen', 'F', None),
 ('Mary', 'Thomas', 'F', None),
 ('Andrea', 'Jones', 'F', None),
 ('Ann', 'Jacob', 'F', None)]